tests/order-stress-test/最终测试结果与可信文档/log5.txt
PS D:\chuangxinshijian\WHUSingularity\deploy> .\run-k6-order-load-one.cmdters/s
time="2026-05-17T15:38:24+08:00" level=warning msg="Found orphan containers ([singularity-influxdb-k6 singularity-grafana-k6 singularity-singularity-order-baseline-1]) for this project. If you removed or renamed this service in your compose file, you can run this command with the --remove-orphans flag to clean it up."
Container singularity-k6-order-load-one-run-aa0528e7f76a Creating 
Container singularity-k6-order-load-one-run-aa0528e7f76a Created 

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
     ✓ status 200

     checks.........................: 100.00% ✓ 1198527     ✗ 0
     data_received..................: 222 MB  3.7 MB/s
     data_sent......................: 307 MB  5.1 MB/s
     dropped_iterations.............: 1411    23.507675/s
     http_req_blocked...............: avg=664.63µs min=618ns      med=2.57µs   max=356.99ms p(90)=5.37µs  p(95)=6.45µs   p(99)=26.09µs
     http_req_connecting............: avg=582.84µs min=0s         med=0s       max=285.38ms p(90)=0s      p(95)=0s       p(99)=0s
   ✓ http_req_duration..............: avg=4.46ms   min=-1876134ns med=436.69µs max=276.15ms p(90)=11.2ms  p(95)=19.95ms  p(99)=57.29ms
       { expected_response:true }...: avg=4.46ms   min=-1876134ns med=436.69µs max=276.15ms p(90)=11.2ms  p(95)=19.95ms  p(99)=57.29ms
   ✓ http_req_failed................: 0.00%   ✓ 0           ✗ 1198527
     http_req_receiving.............: avg=107.4µs  min=-2078258ns med=19.09µs  max=101.75ms p(90)=61.92µs p(95)=98.73µs  p(99)=298.41µs
     http_req_sending...............: avg=169.09µs min=-696863ns  med=9.84µs   max=187.26ms p(90)=79.33µs p(95)=168.63µs p(99)=2.67ms
     http_req_tls_handshaking.......: avg=0s       min=0s         med=0s       max=0s       p(90)=0s      p(95)=0s       p(99)=0s
     http_req_waiting...............: avg=4.18ms   min=0s         med=369.39µs max=204.65ms p(90)=10.88ms p(95)=19.52ms  p(99)=54.46ms
     http_reqs......................: 1198527 19967.81257/s
     iteration_duration.............: avg=5.55ms   min=89.34µs    med=521.17µs max=578.35ms p(90)=11.62ms p(95)=20.83ms  p(99)=72.5ms
     iterations.....................: 1198527 19967.81257/s

running (1m00.0s), 00000/06609 VUs, 1198527 complete and 0 interrupted iterations
snag_single ✓ [=======================] 00000/06609 VUs  1m0s  20000.00 iters/s
PS D:\chuangxinshijian\WHUSingularity\deploy> 06609 VUs  1m0s  20000.00 iters/s