tests/order-stress-test/最终测试结果与可信文档/log6.txt
PS D:\chuangxinshijian\WHUSingularity\deploy> .\run-k6-order-load-one.cmd
time="2026-05-17T15:40:27+08:00" level=warning msg="Found orphan containers ([singularity-influxdb-k6 singularity-grafana-k6 singularity-singularity-order-baseline-1]) for this project. If you removed or renamed this service in your compose file, you can run this command with the --remove-orphans flag to clean it up."
Container singularity-k6-order-load-one-run-2872dbf124b7 Creating 
Container singularity-k6-order-load-one-run-2872dbf124b7 Created 

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
     ✓ status 200

     checks.........................: 100.00% ✓ 1496158      ✗ 0
     data_received..................: 277 MB  4.6 MB/s
     data_sent......................: 384 MB  6.4 MB/s
     dropped_iterations.............: 3844    64.057416/s
     http_req_blocked...............: avg=543.22µs min=0s         med=2.34µs   max=356.42ms p(90)=5.2µs    p(95)=6.23µs   p(99)=20.23µs
     http_req_connecting............: avg=443.17µs min=0s         med=0s       max=237.88ms p(90)=0s       p(95)=0s       p(99)=0s
   ✓ http_req_duration..............: avg=4.03ms   min=-1041067ns med=562.53µs max=216.48ms p(90)=11.01ms  p(95)=16.09ms  p(99)=54.59ms
       { expected_response:true }...: avg=4.03ms   min=-1041067ns med=562.53µs max=216.48ms p(90)=11.01ms  p(95)=16.09ms  p(99)=54.59ms
   ✓ http_req_failed................: 0.00%   ✓ 0            ✗ 1496158
     http_req_receiving.............: avg=112.77µs min=-1469682ns med=18.55µs  max=104.25ms p(90)=67.15µs  p(95)=114µs    p(99)=515.93µs
     http_req_sending...............: avg=248.94µs min=-1415332ns med=13.27µs  max=136.09ms p(90)=102.65µs p(95)=214.66µs p(99)=5.79ms
     http_req_tls_handshaking.......: avg=0s       min=0s         med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s
     http_req_waiting...............: avg=3.67ms   min=0s         med=483.93µs max=167.99ms p(90)=10.49ms  p(95)=15.16ms  p(99)=49.16ms
     http_reqs......................: 1496158 24932.366177/s
     iteration_duration.............: avg=5.47ms   min=85.3µs     med=648.13µs max=552.43ms p(90)=11.55ms  p(95)=17.21ms  p(99)=85.97ms
     iterations.....................: 1496158 24932.366177/s
                                                                                              
running (1m00.0s), 00000/06618 VUs, 1496158 complete and 0 interrupted iterations             
snag_single ✓ [=======================] 00000/06618 VUs  1m0s  25000.00 iters/s